import math
print("""18.23. У скільки разів зміниться опір власного напівпровідника з шириною 
забороненої зони ΔE еВ при його нагріванні від T₁ К до T₂ К?""")
t1 = float(input("Введіть значчення температури напівпровідника до нагрівання(в К): "))
t2 = float(input("Введіть значчення температури напівпровідника після нагрівання(в К): "))
e = float(input("""Введіть значчення ширини забороненої зони напівпровідника(в еВ): """)) * 1.6 / (10 ** 19)
rez = math.exp((e / 2 / 1.38 * (10 ** 23)) * (1 / t2 - 1 / t1))

print(f"Опір власного напівпровідника зміниться в {round(rez, 4)} рази.")
