print("""Середній час життя атома у збудженому стані становить t с. 
При переході атома в основний стан випромінюється фотон із довжиною хвилі 
λ нм. Оцініть природну ширину спектральної лінії на основі 
співвідношення невизначеностей для енергії та часу.""")
t = float(input("Введіть значчення середнього часу життя атома у збудженому стані(в нс)")) / (10**9)
lam = float(input("""Введіть значчення довжини хвилі фотона,
що випромінюється при переході атома в основний стан(в нм)""")) / (10**9)
delta_lambda = (lam ** 2) / (2 * 3.14 * 3 * (10 ** 8) * t)
i = 0
while delta_lambda < 1:
    i += 1
    delta_lambda *= 10

print(f"Природна ширина спектральної лінії Δλ = {round(delta_lambda, 2)}{10**(-i)} м.")
