print("""Знайдіть довжину хвилі де Бройля для альфа-частинки, яка рухається
по колу з радіусом R мм в магнітному полі з індукцією B мТл.""")
r = float(input("Введіть значчення радіусу кола по якому рухається альфа-частинка (в мм)")) / 1000
b = float(input("""Введіть значчення індукції магнітного поля(в мТл)""")) / 1000
if (b * r * 2 * 1.6 / (10 ** 19) / 6.645 * (10 ** 27)) / 300000000 > 0.01:
    lambda_deb = 6.625 / (10 ** 34) / 2 / 1.6 * (10 ** 19) / b / r \
    * ((1 - (((b * r * 2 * 1.6 / (10 ** 19) / 6.645 * (10 ** 27)) / 300000000) ** 2)) ** 0.5)
else:
    lambda_deb = 6.625 / (10 ** 34) / 2 / 1.6 * (10 ** 19) / b / r
i = 0
while lambda_deb < 1:
    i += 1
    lambda_deb *= 10

print(f"Довжину хвилі де Бройля λ = {round(lambda_deb, 2)}{10**(-i)}м.")
